---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
GeometryObject Methods
GeometryObject Class See Also Send Feedback
---

The GeometryObject type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
|  | Equals | Determines whether the specified Object is equal to the current Object.  (Overrides Object..::..Equals(Object).) |
|  | GetHashCode | Gets the integer value of the geometry object as hash code  (Overrides Object..::..GetHashCode()()()().) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also

GeometryObject Class

Autodesk.Revit.DB Namespace